incompressible/simpleFoam/pipeCyclic/system/timeInfo
// -*- C++ -*-
// Record execution/clock time
time
{
    type    timeInfo;
    libs    (utilityFunctionObjects);
    log     true;

    // writeToFile     true;

    perTimeStep     true;
}


// ************************************************************************* //
